[
  {
    "id": 1,
    "title": "Neuro-kinesis",
    "description": "Разработали инновационный веб-интерфейс «Личный кабинет врача» для анализа биомеханических данных пациентов. Ключевая особенность — интерактивная 3D-визуализация мышечной активности в режиме реального времени с использованием динамического градиента.<br/>Реализовал алгоритмы обработки данных с биодатчиков, преобразующие сигналы в визуальные паттерны. <br/><br/><b>Выполненные задачи:</b><br/>Создал адаптивную 3D-модель человеческого тела (WebGL/Three.js) с цветовым градиентом для отображения интенсивности мышечной нагрузки. <br/>Интегрировал инструменты для анализа: сравнение сессий, экспорт отчетов, кастомизация параметров под клинические задачи. <br/><br/><b>Цель:</b><br/> Помогает врачам точно оценивать прогресс восстановления после травм. <br/> Упрощает персонализацию терапии на основе объективных данных.",
    "link": "https://vtomske.ru/news/206367-uchenye-iz-tomska-sozdali-videoigru-dlya-reabilitacii-posle-insulta",
    "imgs": [
      "imgs/kinesis.jpg",
      "imgs/kinesis2.jpg",
      "imgs/kinesisTheme.jpg"
    ],
    "tags": ["React", "Mobx", "threejs"]
  },
  {
    "id": 2,
    "title": "CBI",
    "description": "Реализовал веб-приложение для глубокого анализа статистических данных с поддержкой динамической фильтрации и интерактивной визуализацией. Ключевые особенности:<br/><br/><b>Гибкий выбор периодов:</b> пользователи могут изучать данные за день, месяц, год или произвольный интервал.<br/><br/><b>Многоуровневая фильтраци:</b> более 20 параметров для точной настройки запросов.<br/><br/><b>Визуализация данных:</b> п интеграция графиков (линейные, столбчатые), диаграмм (круговые, тепловые карты) и сортируемых таблиц.<br/><br/><b>Административный интерфейс:</b> разработал панель управления с функционалом добавления/редактирования данных, управлением пользователями и мониторингом активности. <br/><br/><b>Результат</b><br/>Платформа позволила клиентам сократить время анализа данных на 40% за счет интуитивного интерфейса и автоматизации отчетности. Реализована адаптивная верстка и оптимизация запросов к БД, что обеспечило работу с массивами данных до 1 млн записей.",
    "imgs": ["imgs/cbi2.jpg", "imgs/cbi3.jpg", "imgs/cbi.jpg"],
    "tags": ["React", "mobx", "recharts"]
  },
  {
    "id": 3,
    "title": "Администрация Города Томска",
    "description": "Реализовал приложение для интерактивного определения пользователем участка для голосования в думу. <br/> При помощи yandex maps, html, css, и не много java/domino создал скрипт, работающий внутри платформы мэрии г. Томска, который определяет по координатам каждый избирательный участок в точности до дома, что позволило пользователям без проблем найти свой дом и участок к которому они относятся",
    "imgs": ["imgs/download.jpg", "imgs/admin.png"],
    "link": "https://admin.tomsk.ru/",
    "tags": ["html", "css", "jquery"]
  },
  {
    "id": 4,
    "title": "Тэк-торг (Роснефть)",
    "description": "Участвовал в разработке корпоративной платформы для госзакупок в составе cross-functional команды (15+ разработчиков, дизайнеров, аналитиков)<br/><br/>Реализовал 10+ переиспользуемых React-компонентов (таблицы, фильтры, карточки товаров) с поддержкой адаптивности.<br/>Интегрировал модуль для Роснефти — функционал тендеров с двухэтапной верификацией, что увеличило конверсию партнёрских заявок на 25%.<br/> Оптимизировал производительность: сократил время загрузки страниц на 15% через lazy loading и кеширование.<br/>Разработал систему скелетон-прелоадеров, снизившую визуальный «шум» при загрузке данных.",
    "link": "https://www.tektorg.ru/",
    "imgs": ["imgs/tek.jpg", "imgs/rosneft.png"],
    "tags": ["Nextjs", "redux", "scss"]
  },
  {
    "id": 5,
    "title": "Bimeister",
    "description": "В качестве ключевого frontend-разработчика разрабатывал проект Bimeister. <br/><br/>Единолично поддерживал проект после релиза: обрабатывал 50+ тикетов в месяц, исправлял критические баги (память, рендеринг). <br/>Сайт полностью адаптивен под различные устройства.",
    "link": "https://bimeister.com/ru/",
    "imgs": [
      "imgs/bimeister.jpg",
      "imgs/bimeister2.jpg",
      "imgs/bimeister3.jpg"
    ],
    "tags": ["Pug", "scss", "VanilaJs"]
  },
  {
    "id": 6,
    "title": "НЛМК",
    "description": "Здесь моя роль была не большой: верстка пары блоков и доработка уже имеющихся для лендингов НЛМК. <br/> При помощи GSAP создал анимацию отображения элементов при скролле блока.",
    "link": "https://ngoes.nlmk.shop/ru/",
    "imgs": ["imgs/nlmk.jpg", "imgs/nlmk2.jpg"],
    "tags": ["Pug", "scss", "VanilaJs"]
  },
  {
    "id": 7,
    "title": "Sibur",
    "description": "Разработал 5+ сложных форм (многошаговая подача заявок, калькуляторы) с обработкой 10+ типов данных.<br/>Исправил 30+ критических багов (утечки памяти, race conditions в асинхронных запросах).<br/>Унифицировал стили: создал глобальную тему с переменными CSS для 20+ компонентов.",
    "link": "https://www.sibur.ru/ru/",
    "imgs": ["imgs/sibur.png", "imgs/sibur2.jpg"],
    "tags": ["Pug", "scss", "VanilaJs"]
  },
  {
    "id": 8,
    "title": "Severstal",
    "description": "Адаптивная верстка компонентов, сборка страниц, ssr, seo и прочие стандартные радости жизни!",
    "link": "https://severstal.com/rus/",
    "imgs": ["imgs/severstal.jpg", "imgs/severstalmain.jpg"],
    "tags": ["Nextjs", "css-in-js"]
  },
  {
    "id": 9,
    "title": "Успешная аттестация на junior+",
    "description": "Выполнил комплексное тестовое задание с полным циклом разработки:<br/><br/>Реализовал виджет погоды с прогнозом на 7 дней (интеграция OpenWeather API).<br/><br/>Настроил глобальное управление состоянием темы (Context API + LocalStorage).<br/><br/>Достиг 100% покрытия ключевых сценариев юнит-тестами (Jest + React Testing Library).",
    "link": "https://github.com/funversuta/test",
    "imgs": ["imgs/junior.jpg", "imgs/test.jpg"],
    "tags": ["Nextjs", "css-in-js"]
  },
  {
    "id": 10,
    "title": "Retn",
    "description": "Довёл проект до релиза<br/>Устранил 20+ узких мест производительности (оптимизация FCP на 40%).<br/><br/>Исправил более 100 багов важных для заказчика.",
    "link": "https://retn.ru/",
    "imgs": ["imgs/retn.png", "imgs/retn.jpg"],
    "tags": ["Nextjs", "css-in-js"]
  }
]
